Verification/Methalox/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  	(0.0 0.0 0.0) // 0 
	(0.24444228172466226 0.0 0.0) // 1 
	(0.24944228172466226 0.0 0.0) // 2 
	(0.2816719254635535 0.0 0.0) // 3 
	(0.309348502602977 0.0 0.0) // 4 
	(0.3190077608658677 0.0 0.0) // 5 
	(0.5834097257668167 0.0 0.0) // 6 
	(0.5969326873348637 0.0 0.0) // 7 
	(11.492331718337159 0.0 0.0) // 8 
	(0.0 0.050600055329416124 0.0022071434141212364) // 9 
	(0.24444228172466226 0.050600055329416124 0.0022071434141212364) // 10 
	(0.24944228172466226 0.04926285843619369 0.002148815704852043) // 11 
	(0.2816719254635535 0.02914640711117126 0.0012713484220899629) // 12 
	(0.309348502602977 0.025509649277311953 0.0011127152733809336) // 13 
	(0.3190077608658677 0.02809291530530605 0.0012253957549237212) // 14 
	(0.5834097257668167 0.0988044125107971 0.004309787942712909) // 15 
	(0.5969326873348637 0.10242098494998883 0.004467540616872811) // 16 
	(0.5969326873348637 0.9217888645498995 0.04020786555185531) // 17 
	(11.492331718337159 0.9217888645498995 0.04020786555185531) // 18 
	(11.492331718337159 0.10242098494998883 0.004467540616872811) // 19 
	(0.0 0.05064826125139163 -0.002209246126905189) // 20 
	(0.24444228172466226 0.05064826125139163 -0.002209246126905189) // 21 
	(0.24944228172466226 0.049309790430528584 -0.0021508628496927644) // 22 
	(0.2816719254635535 0.029174174460790153 -0.0012725596168690983) // 23 
	(0.309348502602977 0.025533951941699943 -0.001113775340712883) // 24 
	(0.3190077608658677 0.02811967900891182 -0.0012265631712786323) // 25 
	(0.5834097257668167 0.09889854200866667 -0.004313893813742986) // 26 
	(0.5969326873348637 0.1025185599027633 -0.004471796776535035) // 27 
	(0.5969326873348637 0.9226670391248697 -0.04024617098881532) // 28 
	(11.492331718337159 0.9226670391248697 -0.04024617098881532) // 29 
	(11.492331718337159 0.1025185599027633 -0.004471796776535035) // 30 
);

blocks
(
    	 hex (0 20 9 0 1 21 10 1 ) (20 1 49) simpleGrading (1 1 1)
	 hex (1 21 10 1 2 22 11 2 ) (20 1 2) simpleGrading (1 1 1)
	 hex (2 22 11 2 3 23 12 3 ) (20 1 7) simpleGrading (1 1 1)
	 hex (3 23 12 3 4 24 13 4 ) (20 1 6) simpleGrading (1 1 1)
	 hex (4 24 13 4 5 25 14 5 ) (20 1 2) simpleGrading (1 1 1)
	 hex (5 25 14 5 6 26 15 6 ) (20 1 53) simpleGrading (1 1 1)
	 hex (6 26 15 6 7 27 16 7 ) (20 1 3) simpleGrading (1 1 1)
    hex (7 27 16 7 8 30 19 8 ) (20 1 800) simpleGrading (1 1 1)//
    hex (27 28 17 16 30 29 18 19 ) (30 1 800) simpleGrading (1 1 1)//
);

edges
(
    	 arc 10 11 (0.24703047217568747 0.05025996190489803 0.002192308747296778)
    	 arc 12 13 (0.29990853755048674 0.024269218906061308 0.0010586084605176242)
    	 arc 21 22 (0.24703047217568747 0.05030784382491385 -0.002194397327313744)
    	 arc 23 24 (0.29990853755048674 0.024292339830838477 -0.0010596169810917243)
    //EDGE5_txt
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            	(0 20 9 0 )
            
        );
    }
    asym1
    {
        type wedge;
        faces
        (
            	 (0 9 10 1)
	 (1 10 11 2)
	 (2 11 12 3)
	 (3 12 13 4)
	 (4 13 14 5)
	 (5 14 15 6)
	 (6 15 16 7)
            (7 16 19 8)//
            (16 17 18 19)//
        );
    }



    outlet
    {
        type patch;
        faces
        (
           //(7 27 16 7 ) 
            (8 30 19 8)//
            (30 29 18 19)//
            //(17 28 29 18) //
        );
    }

    outlet_r
    {
        type patch;
        faces
        (
           //(7 27 16 7 ) 
           // (8 30 19 8)//
            //(30 29 18 19)//
            (17 28 29 18) //
        );
    }



    asym2
    {
        type wedge;
        faces
        (
            	(1 21 20 0)
	(2 22 21 1)
	(3 23 22 2)
	(4 24 23 3)
	(5 25 24 4)
	(6 26 25 5)
	(7 27 26 6)
            (8 30 27 7)//
            (30 29 28 27) //
        );
    }
    nozzle
    {
        type wall;
        faces
        (
            	(9 20 21 10)
	(10 21 22 11)
	(11 22 23 12)
	(12 23 24 13)
	(13 24 25 14)
	(14 25 26 15)
	(15 26 27 16)
            (16 27 28 17)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //