Verification/Methalox/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       83908;
    }
    asym1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          42440;
        startFace       83928;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       126368;
    }
    outlet_r
    {
        type            patch;
        nFaces          800;
        startFace       126418;
    }
    asym2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          42440;
        startFace       127218;
    }
    nozzle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          152;
        startFace       169658;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       169810;
    }
)

// ************************************************************************* //
