Verification/Methalox/0/epsilon

/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 266000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 266000;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    outlet_r
    {
        type            inletOutlet;
        inletValue      uniform 266000;
        value           uniform 266000;
    }
    nozzle
    {
        type            epsilonWallFunction;
        value           uniform 266000;
    }

    asym2
    {
        type            wedge;
        
    }
    asym1
    {
        type            wedge;
        
    }
}


// ************************************************************************* //