Verification/Methalox/0/k

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }

    outlet
    {
        type            inletOutlet;
	inletValue 			uniform 1000;
        value           uniform 1000;
    }

    nozzle
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }

    asym2
    {
        type            wedge;
        
    }
    asym1
    {
        type            wedge;
        
    }
    outlet_r
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

}


// ************************************************************************* //